Revit 2027 API
BalusterInfo.GetReferenceNameForHost Method
 Gets the name string to be used as a reference to Host in the current language.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetReferenceNameForHost()
Public Shared Function GetReferenceNameForHost As String
public:
static String^ GetReferenceNameForHost()
static member GetReferenceNameForHost : unit -> string
Return Value
String
 The name string to be used as a reference to Host.
Remarks
 This name can be used in the setter for BaseReferenceName or TopReferenceName. The name can also be compared with the value coming from the getter.
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace